/*
SQLyog 企业版 - MySQL GUI v8.14 
MySQL - 5.0.16 : Database - jltcdpw
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`jltcdpw` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `jltcdpw`;

/*Table structure for table `city` */

DROP TABLE IF EXISTS `city`;

CREATE TABLE `city` (
  `city_id` int(11) NOT NULL auto_increment,
  `city_name` varchar(255) default NULL,
  PRIMARY KEY  USING BTREE (`city_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `city` */

insert  into `city`(`city_id`,`city_name`) values (1,'长春'),(2,'吉林'),(3,'四平'),(4,'辽源'),(5,'通化'),(6,'白山'),(7,'松原'),(8,'白城'),(9,'延吉');

/*Table structure for table `common` */

DROP TABLE IF EXISTS `common`;

CREATE TABLE `common` (
  `common_id` int(30) NOT NULL auto_increment,
  `common_account` varchar(225) default NULL,
  `common_specialty` int(30) default NULL,
  `common_message` varchar(225) default NULL,
  `common_time` datetime default NULL,
  `common_img` varchar(225) default NULL,
  `common_others` int(30) default NULL,
  `common_count` int(30) default '0',
  `common_type` int(32) default NULL,
  PRIMARY KEY  (`common_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `common` */

insert  into `common`(`common_id`,`common_account`,`common_specialty`,`common_message`,`common_time`,`common_img`,`common_others`,`common_count`,`common_type`) values (1,'123456',1,'aaa','2020-04-24 00:00:00','1.jpg',NULL,1,1),(2,'3456',NULL,'bbb','2020-04-24 00:00:00','1.jpg',1,0,1),(22,'123456',1,'就这样吧\r\n','2020-05-02 23:12:27',NULL,20,0,1),(23,'123456',1,'这回行了吧','2020-05-02 23:20:21',NULL,19,0,1),(24,NULL,NULL,NULL,NULL,NULL,NULL,0,1),(25,'123456',1,'再试一下','2020-05-02 23:23:41',NULL,19,0,1),(26,'123456',1,'再来一下','2020-05-02 23:25:16',NULL,19,0,1),(27,'123456',1,'很好吃',NULL,NULL,NULL,3,NULL),(28,'123456',1,'好的','2020-05-10 13:35:56',NULL,27,0,NULL),(29,'pqq456',1,'味道很不错',NULL,NULL,NULL,0,NULL),(30,'123456',1,'这个大米质量很好的',NULL,NULL,NULL,0,NULL),(31,'123456',1,'是很好的大米',NULL,NULL,NULL,0,NULL),(32,'123456',1,'很好','2020-05-11 20:56:01',NULL,27,0,NULL),(33,'123456',1,'我也这样认为','2020-05-11 20:56:30',NULL,27,0,NULL),(34,'123456',4,'很好','2020-05-13 12:22:47',NULL,NULL,1,NULL),(35,'123456',4,'我也这样认为','2020-05-13 12:22:47',NULL,34,0,NULL),(36,'123456',6,'我觉得很好',NULL,NULL,NULL,1,NULL),(37,'123456',6,'我也这样认为','2020-05-13 13:08:24',NULL,36,0,NULL),(39,'123456',6,'这个大米好好吃',NULL,NULL,NULL,0,NULL),(40,'123456',4,'这种的木耳营养价值很高','2020-05-17 22:05:02',NULL,NULL,1,NULL),(41,'123456',4,'我也这样认为','2020-05-17 22:05:02',NULL,40,0,NULL);

/*Table structure for table `goods` */

DROP TABLE IF EXISTS `goods`;

CREATE TABLE `goods` (
  `goods_id` int(32) NOT NULL auto_increment,
  `goods_name` varchar(225) default NULL,
  `goods_des` varchar(225) default NULL,
  `goods_img` varchar(225) default NULL,
  `goods_price` int(225) default NULL,
  `createTime` datetime default NULL,
  `updateTime` datetime default NULL,
  `goods_shop` int(32) default NULL,
  PRIMARY KEY  (`goods_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `goods` */

insert  into `goods`(`goods_id`,`goods_name`,`goods_des`,`goods_img`,`goods_price`,`createTime`,`updateTime`,`goods_shop`) values (3,'万昌大米','测试123','eb49593536704e898c31d07aebc87fbe.jpg',38,'2020-05-05 20:18:07',NULL,5),(6,'富硒长粒香大米','大米颗粒饱满清甜不回生','001940419aeb4ac5886cff7203b6de81.jpg',38,'2020-05-10 11:40:58',NULL,2),(7,'万昌大米','大米颗粒饱满清甜不回生','a5c2432ec4274792bbff613556f54198.jpg',38,'2020-05-17 23:33:50',NULL,5);

/*Table structure for table `prase` */

DROP TABLE IF EXISTS `prase`;

CREATE TABLE `prase` (
  `prise_obj` int(32) NOT NULL,
  `prase_count` int(32) default NULL,
  `prase_type` int(32) default NULL,
  PRIMARY KEY  (`prise_obj`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `prase` */

/*Table structure for table `region` */

DROP TABLE IF EXISTS `region`;

CREATE TABLE `region` (
  `region_id` int(11) NOT NULL auto_increment,
  `region_name` varchar(255) default NULL,
  `region_city` int(255) default NULL,
  PRIMARY KEY  (`region_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `region` */

insert  into `region`(`region_id`,`region_name`,`region_city`) values (1,'二道',1),(2,'朝阳',1),(3,'南关',1),(4,'宽城',1),(5,'绿园',1),(6,'高新',1),(7,'净月',1),(8,'经开',1),(9,'汽车城',1),(10,'长春新区',1),(11,'德惠',1),(12,'九台',1),(13,'榆树',1),(14,'农安',1),(15,'双阳',1),(16,'船营区',2),(17,'昌邑区',2),(18,'龙潭区',2),(19,'丰满区',2),(20,'舒兰市',2),(21,'桦甸区',2),(22,'蛟河',2),(23,'磐石',2),(24,'永吉',2),(25,'铁西',3),(26,'铁东',3),(27,'公主岭',3),(28,'双辽',3),(29,'梨树',3),(30,'伊通',3),(31,'龙山',4),(32,'西安',4),(33,'东辽',4),(34,'东丰',4),(35,'东昌区',4),(36,'二道江区',5),(37,'梅河口市',5),(38,'集安市',5),(39,'通化县',5),(40,'辉南县',5),(41,'柳河县',6),(42,'八道江市',6),(43,'临江市',6),(44,'靖宇县',6),(45,'抚松县',6),(46,'江源县',6),(47,'长白朝鲜自治县',6),(48,'扶余县',7),(49,'乾安县',7),(50,'长岭县',7),(51,'宁江区',7),(52,'前郭镇',7),(53,'洮北县',8),(54,'大安市',8),(55,'洮南县',8),(56,'镇赉县',8),(57,'通榆县',8),(58,'汪清县',9),(59,'图们市',9),(60,'敦化市',9),(61,'龙井市',9),(62,'珲春市',9),(63,'和龙市',9),(64,'安图县',9);

/*Table structure for table `shop` */

DROP TABLE IF EXISTS `shop`;

CREATE TABLE `shop` (
  `shop_id` int(11) NOT NULL auto_increment,
  `shop_name` varchar(255) default NULL,
  `shop_city` int(255) default NULL,
  `shop_region` int(255) default NULL,
  `shop_address` varchar(255) default NULL,
  `shop_status` varchar(255) default '0',
  `shop_tel` varchar(255) default NULL,
  `createDate` datetime default NULL,
  `updateDate` datetime default NULL,
  `open_time` varchar(255) default NULL,
  `shop_img` varchar(255) default NULL,
  `shop_des` varchar(255) default NULL,
  `shop_register` varchar(255) default NULL,
  PRIMARY KEY  (`shop_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `shop` */

insert  into `shop`(`shop_id`,`shop_name`,`shop_city`,`shop_region`,`shop_address`,`shop_status`,`shop_tel`,`createDate`,`updateDate`,`open_time`,`shop_img`,`shop_des`,`shop_register`) values (2,'万昌大米总店',1,1,'吉大家属楼','0','17843102015','2020-05-09 11:06:46','2020-05-10 11:06:46','9:00-10:00','万昌大米总店.jpg','富硒 吉林 长 万昌 新米 蟹田','pqq456');

/*Table structure for table `specialty` */

DROP TABLE IF EXISTS `specialty`;

CREATE TABLE `specialty` (
  `specialty_id` int(11) NOT NULL auto_increment,
  `specialty_name` varchar(255) default NULL,
  `specialty_img` varchar(255) default NULL,
  `specialty_type` int(255) default NULL,
  `specialty_localCity` int(255) default NULL,
  `specialty_localRegion` int(255) default NULL,
  `specialty_des` longtext,
  `createDate` datetime default NULL,
  `updateDate` datetime default NULL,
  PRIMARY KEY  USING BTREE (`specialty_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `specialty` */

insert  into `specialty`(`specialty_id`,`specialty_name`,`specialty_img`,`specialty_type`,`specialty_localCity`,`specialty_localRegion`,`specialty_des`,`createDate`,`updateDate`) values (3,'吉林长白山人参','0f8344bc02bd49cd8db12b7fa176adb9.jpg',2,6,NULL,'人参又名棒槌，因其根似人形，故名人参。吉林人参，产于长白山区，以其品质地道、上 乘、产量大，被誉为中国人参的正宗，与“貂皮”、“鹿茸角”一起被称为“东北三 宝”。发祥于长白山的满族称其为“奥尔厚达”，意为“百草之王”，足见人们对人参的厚爱。走进长白山林区，会听到许多关于人参的美妙、神奇的传说，为人参更增添了神秘色彩。人参为五加科多年生草本植物，根肉质肥大，呈圆柱状或纺锤形，常分枝，须根上长有多数疣状物。茎单一直立，掌状复叶生于茎端，根据生长年限不同，叶数有所不同。初生叶为三对复叶，称“三花子”；第二年变为由五小叶组成的掌状复叶，俗称“巴掌”； 第三年生为二枚掌状复叶，通称“二甲子”；以后随年龄增加叶数随之增加，三叶者称“灯台子”，四叶者为“四匹子”，五叶、六叶者分别为“五匹叶”、“六匹叶”，以后年限再增加，叶数也不再增多。人参生三年开始开花，伞形花序顶生，小花淡黄绿色，花期6-7月，7-9月果实成熟，浆果鲜红色，俗称“亮红顶”。\r\n　　乾隆皇帝在《咏人参》中盛赞人参是“一穗垂如天竺丹”，形象地描绘了这种植株的优美形态。野生人参，一般生长在以红松为主的针阔叶混交林下，对自然环境的选择比较严格，多生长于腐殖质深厚，排水良好，郁闭度适宜的疏松的砂质土壤中。人参根入药已有两千多年的历史，始载于《神农本草经》中，列为上品，为补药之道，在中药史上享有极高地位，李时珍在《本草纲目》中称其为“神草”。','2020-05-10 10:49:57','2020-05-10 10:50:21'),(4,'黄松甸黑木耳','dc78b25245af49caba8bca56bd34dbe3.jpg',1,2,22,'黄松甸黑木耳，吉林省特产，中国国家地理标志产品。主产于该省蛟河市黄松甸镇及周边地区。由于特殊的种植环境和种植方法，黄松甸黑木耳成分独特，品质优良，被评为中国“全国名牌产品”。\r\n　　　蛟河市黄松甸镇是“中国黑木耳第一镇”、“食用菌之乡”、食用菌“全国优秀基地镇”、“全国小蘑菇新农村建设优秀示范镇”。.黄松甸黑木耳，于2001年注册为“黄松甸”品牌，2001年“黄松甸”牌黑木耳被吉林市人民政府评为“吉林市名牌农产品”；2003年“黄松甸”牌黑木耳被吉林省人民政府评为“吉林名牌产品”；2004年中国全国第七届食用菌学术研讨会暨新技术新产品交流会推荐“黄松甸”牌黑木耳为“全国名牌产品”。.\r\n\r\n　　品质特点\r\n\r\n　　　　黄松甸镇位于蛟河市区东50公里，地处长白山脉延续山区，海拔474米，地势高寒，无霜期较短，冬季寒冷漫长，夏季昼夜温差较大。独特的气候条件、生长环境和生产管理技术，生产出独特、优质的黑木耳，在食用口感、理化指标、外观形状上与其他产区的黑木耳都有所区别。\r\n　　一、“黄松甸”牌黑木耳生长于气候地势高寒、昼夜温差大的环境下，生长相对缓慢，干物质积累较多，所以耳片较厚，耳肉弹性好，食用口感特别好。\r\n　　二、“黄松甸”牌黑木耳采用威虎河水浇灌，水源纯净*全镇森林覆盖率91%，空气清洁*域内没有工厂。“黄松甸”牌黑木耳生长于没有任何污染的绿色、天然环境中，符合绿色、无公害食品生产标准，品质极佳。\r\n　　三、“黄松甸”牌黑木耳采用地栽法生产，栽培料以硬杂木木屑为主，耳肉有弹性，食用口感好，与其他产地木耳不同。\r\n　　四、“黄松甸”牌黑木耳选用单片品种，生产管理精心，采摘晾晒时单片摆放，适时翻晒，外观形状自然卷曲，颜色与光泽自然、较深。生产过程采取覆膜等措施，耳片上不附着的沙土等杂质，商品性好。.\r\n\r\n　　生产情况\r\n\r\n　　　　蛟河市黄松甸镇依托资源优势，把食用菌产业不断做大升级，发展成为 图2 黄松甸镇木耳栽植基地\r\n\r\n　　.富民第一大产业。全镇85%以上的村发展食用菌种植业、85%以上的农户从事食用菌种植业、农民收入的85%来源于食用菌产业。全镇年种植黑木耳1.5亿袋、木灵芝及其它菇类900万袋，产值2.3亿元；年交易量1.2万吨、交易额4.8亿元。5个令人关注数字，表述了黄松甸镇食用菌产业的绝对量。\r\n　　黄松甸的食用菌生产起源于20世纪六、七十年代。这里地处长白山区，森林覆盖率高达91%，自然资源丰富，气候条件优越，交通便捷，适合种植食用菌，黄松甸把食用菌作为一项富民产业进行谋划和设计。一是依托基地，全镇成立了食用菌协会，每个村都有一个分会；各村相继组建了食用菌销售中心；有的村还建立了专业协会或具备协会性质的特色研究所。协会集技术培训、生产示范、信息传递于一体，统一菌种购买、统一生产管理、统一产品销售。二是让典型现身说法，引领带动。三是专业化生产，规模化发展，离不开技术的支撑，技术培训成了富民路上的重要一环。黄松甸镇中学，就是这个镇食用菌技术培训基地。围绕主导产业发展，培训班聘请技术专家和种植能手，为参加培训的农民讲解食用菌系列产品开发、优良品种选育、市场前景分析和营销信息技术，参加培训达400人次。镇里还协调蛟河市供销社和就业局，举办经纪人和园艺技能培训班，在2100名参加培训的农民中，有136人获得了国家颁发的资格证书。\r\n　　2008年，伟光食用菌产业集中区在原有的基础上，新建管理房10个、灵芝大棚50栋、食用菌发酵室10栋、硬覆盖1500延长米、U型边沟3000延长米，新增黑木耳种植户58家，年种植黑木耳270万袋，灵芝15万椴；以此为样板，他们在北场子、金丰、长青、沙河掌等村打造一批产业集中区。还建成了黄松甸食用菌大市场适时而生。市场位于蛟河市302国道306公里处，建设项目总投资2960万元，规划占地面积7万平方米，建筑面积3万平方米，年交易量1.2万吨、交易额4.8亿元。.\r\n\r\n　　地理标志产品保护\r\n\r\n　　　　根据《地理标志产品保护规定》，国家质检总局组织了对黄松甸黑木耳地理标志产品保护申请的审查。经审查合格，批准自2010年4月6日起对黄松甸黑木耳实施地理标志产品保护（总局公告2010年第28号）。\r\n\r\n　　保护范围\r\n\r\n　　　　黄松甸黑木耳地理标志产品保护范围为吉林省蛟河市黄松甸镇、白石山镇、漂河镇、前进乡、新站镇、乌林朝鲜族乡、拉法街道、天岗镇、庆岭镇、松江镇、天北镇、新农街道、河南街道等13个乡镇街道所辖行政区域。.','2020-05-10 10:53:24',NULL),(5,'永吉蚕蛹虫草','99a9f0d77bc745728207f5d98caf6c66.jpg',1,2,24,'野生蛹虫草（北冬虫夏草）是全吉林省一级重点保护植物。县志记载永吉县从1826年（清道光六年）开始放养柞蚕，在近200年的历史长河中，沉淀蚕农多少代人的养蚕文化。 吉林省蚕业科学研究院，是我国人工培育蛹虫草最早发明单位， 1986年向国家申报了发明专利，并且带动永吉县境内的民营企业和个人的柞蚕蛹虫草种植业迅速发展起来，逐渐形成规模。 蛹虫草所含蛋白与人体的蛋白结构和数量比较接近，容易吸收，免疫球蛋白和丰富的赖氨酸具有抗疲劳和增强人体免疫力作用。 目前，虫草酒、虫草茶、虫草米、虫草玉米面粉等蛹虫草深加工产品也相续走上市场。\r\n　　柞蚕蛹虫草是将北冬虫夏草菌接种到柞蚕蛹体上生长成的子实体，在其药理学作用上与冬虫夏草相近。\r\n\r\n　　地域范围\r\n\r\n　　吉林省永吉县珍稀植的保护协会申请农产品地理标志产品名称为永吉柞蚕蛹虫草，地理标志范围是永吉县口前镇所辖10个行政村，东经125°48′9″～126°40′1″，北纬43°18′7″～43°35′00″之间的永吉柞蚕蛹虫草生产区域。\r\n\r\n　　产品品质特性特征\r\n\r\n　　1、外在感官特征 永吉柞蚕蛹虫草子实体直立生长不弯曲，每个蛹长草5根以上，鲜草长度平均4一6厘米以上，颜色桔红或桔黄，鲜草有食用菌的清香味，放在嘴里嚼略有微腥，入水后水立即变为黄色，子实体连代菌核一起出售。 2、内在品质指标. 2.1、蛹虫草子实体 蛹虫草子实体100.0％ 腺苷≥0.055％ 多糖≥2.5％ 虫草素0.026％～0.053％ 虫草酸7.10％～11.23％ 麦角甾醇0.74mg／g～1.68mg／g 2.2、柞蚕蛹虫草全草 蛹虫草子实体100.0％ 腺苷≥0.035％～0.045％ 多糖1.0％～1.5％ 虫草素0.015％～0.025％ 虫草酸5.10％～8.23％ 麦角甾醇0.74mg／g～1.15mg／g 2.3、永吉柞蚕蛹虫草子实体氨基酸含量 虫草素7.10％～11.23％ 虫草多糖1.0％～1.5％ 虫草酸7.10％～11.23％ 天门冬氨酸Asp1819～2619 苏氨酸Thr1200～1753 丝氨酸Ser1100～1322 谷氨酸Ser3500～5251 甘氨酸Clu850～1203 丙氨酸Ala1200～1573 胱氨酸Cys500～763 等等 3、安全要求 永吉柞蚕蛹虫草符合最新版本国家食品安全食用菌标准，对应于国际食品法典委员会（CAC）标准CodexStan38-1981《食用菌和真菌制品通用标准》，本标准由中华人民共和国卫生部提出并归口。 理化指标 水分a/(g/100g)≤12 总砷（以As计）/（mg/kg）≤1.0-0.5 铅（Pb）/（mg/kg）≤2.0-1.0 总汞（Hg）/（mg/kg）≤0.2-0.1 六六六/（mg/kg）≤0.2-0.1 微生物指标 菌落总数（CFU∕g）≤1000 大肠菌落（MPN∕g）≤0.3 霉菌计数（CFU∕g）','2020-05-10 13:39:26',NULL),(6,'万昌大米','万昌大米.jpg',1,2,24,'吉林省永吉县万昌镇地处长白山麓西，这里山清水秀、黑土肥沃，水稻生产条件优异，得天独厚的自然条件加上无任何污染的长白山水系自流灌溉孕育出了特有的绿色晚粳稻谷，万昌系列优质珍珠米正是以该稻谷为原料，采用科学方法加工而成，其米粒色汉洁白如玉，晶莹剔透，清亮如珍珠。煮熟后香气四溢，且胀份小、粘性大口感甚佳。本产品经农业部产品质量监督检验测试中心检验各项指标优良达到产品标准。本产品含有人体所必须的氨基酸19种，蛋质含量达12%，脂肪含量2%，并含有多种维生素和钙、磷、铁、锌、硒等人体必须的微量元素，实为消费者喜爱之食用佳品。\r\n　　多年来，地方政府在调整种植结构上很下功夫，指导本地农民种植优质水稻，并依靠高科技和现代化管理手段，不断更新改造加工设备，新引进的日本佐竹色选同可确保产品中无任何异色性。研制开发出的“万昌”牌系列东北优质大米，1998年被吉林省人民政府评为吉林名牌产品；2000年1月被吉林市质量管理协会、吉林市用户委员会评为用户满意产品；2000年8月被2000年中国长春国际农业食品博览会评为金奖产品，自投放市场以来，畅销不衰，万昌大米不仅畅销全国、而且远销日本、韩国、新加坡等国家和地区，在国内和国际上享有很高的信誉。\r\n\r\n　　地域范围\r\n\r\n　　行政区域包括永吉县岔路河特色农业经济开发区现辖的万昌镇、岔路河镇、一拉溪镇、金家乡、星星哨水库灌区管理局，共计3镇1乡1个管理局55个行政村的水稻田。地理位置为:东经125°33′-126°12′,北纬43°23′-43°52′,平均海拨200米以下，水稻种植面积20000公顷，总产量18万吨。具体地域范围是：东至一拉溪镇贾河子村代王沟屯东与吉林市交界处，南至金家乡金家村碾子沟屯南黄榆背山西坡，西到万昌镇新房子村后杨家屯饮马河东岸，北到一拉溪镇富家村朱下沟屯北与九台市交界处。\r\n\r\n　　自然生态环境和人文历史因素\r\n\r\n　　（1）土壤地貌情况：岔路河特色农业经济开发区水田分布在松辽平原南端开阔平原，由境内饮马河、岔路河、鳌龙河冲积形成。土壤类型为草甸土、冲积土和水稻土，土层深厚，土质酥松、肥沃。土壤平均有机质含量≥3.34%，全氮含量0.1535%，全磷含量0.0944%，全钾含量3.226%，富含硅、锌、铁、硒等微量元素，土壤pH值为6.1-6.42。\r\n\r\n　　（2）水文情况：全区境内饮马河、岔路河、鳌龙河等七条河流为第二松花江水系一级支流。年平均降水量为650-700毫米，5-9月份降水量595毫米，占全年降水量的80%，年降水总量为7.2亿立方米。多年来，河流平均径流量\r\n\r\n　　可保持4亿立方米。全区可利用水资源总量为5.82亿立方米（含地表水和地下水），水量充沛，流向有利，适合大面积绿色水稻种植。区内有星星哨水库等大中小型水库7座，其中星星哨水库为省内大型水库，库区集水面积845平方公里，上游无任何污染源，正常蓄水11600万立方米，最高蓄水26500万立方米，灌区面积16.5万亩，防洪保护面积2.25万亩，除涝面积1.5万亩，可保证5个乡镇55个行政村的水田灌溉用水。\r\n\r\n　　（3）气候情况：永吉县属北温带大陆性季风气候，地势东南面环山，西北面为开阔平原，形成独特的小气候区。年平均气温4.9℃，≥10℃有效积温2794℃，全年日照时数2500-2800小时，实照率为65%。4-9月份作物生长季节日照时数1500-1600小时，无霜期138-145天，7-8月份高温多雨，雨热同季，利于水稻生长。8-9月份水稻出穗至成熟期平均气温22.7℃，昼夜温差大，平均温差11.4℃，有利于水稻养分的积累。永吉县洪涝、早霜等自然灾害较少，冬季寒冷，威胁水稻生产的病虫害较轻。\r\n\r\n　　（4）人文历史情况：永吉县岔路河特色农业经济区种植水稻至今已有150年的历史。据《永吉县志》记载：“清康熙年间,这一带曾经是饲养军马的牧场，称为西马场，经多年开垦，渐为耕地，以种植高梁、稗子、粳稻等抗涝作物为主，尤以粳米驰名省内……”，民间有“岔路河粳米可煮三次，味不改，饭粒亦不破，谓之顶三水”之说。\r\n\r\n　　1903年（光绪二十九年），大批朝鲜族农民迁入饮马河、岔路河、鳌龙河沿河一带，同当地的汉、满、回等民族一道利用自然河道，修建柳条拦河坝，扩大水田种植规模。1927年（中华民国16年）有王光慎、刘会等种田大户在饮马河东岸、岔路河北岸修堤3000米，堤高1.5米，控制洪水，并将河道截湾，挖排水沟2-3公里，控制内涝，将洼地旱田改水田，集中连片种植，水稻种植面积大增。到1944年水田面积已达到14.3万亩。\r\n\r\n　　70年代星星哨水库全面建成，促进了当地水稻生产的快速发展，水田面积发展到15000公顷，并成为全国商品粮基地县。2003年经联合国工业发展组织中国投资技术促进处绿色产业委员会确认：永吉县岔路河农业经济示范区为绿色产业园区；2006年中国绿色食品发展中心、中国绿色食品协会确认吉\r\n\r\n　　林省永吉县为“绿色农业示范区建设单位”；2007年经农业部绿色食品管理\r\n\r\n　　办公室、中国绿色食品发展中心批准吉林省永吉县为“全国绿色食品原料（水稻）标准化生产基地”。\r\n\r\n　　在150年水稻种植实践中，永吉稻农形成了一整套科学先进“浅—润（晒）—浅”间歇灌溉技术；永吉水稻科研人员培育的优良水稻品种“双丰8号”，以其抗病、抗寒、早熟、丰产性好的特点，从70年代开始在全省示范推广，成为全省稻农种植中早熟品种的首选；其编制的吉林省地方标准《水稻钵育稀植综合栽培技术规程》（DB22/T848-1996），成为指导我省水稻种植的技术标准；县农科站独创的大棚旱育技术、大棚盘育苗机插秧技术，使平均亩产从466公斤，达到现今的1000公斤，并荣获国家科委农业技术推广奖和省科研成果奖。\r\n\r\n　　生产技术要求\r\n\r\n　　（1）产地选择：产地环境符合NY/T391-2000《绿色食品产地环境技术条件》。土壤选择草甸土、冲击土和水稻土。灌溉用水符合GB5084-92《农田灌溉水质标准》的规定。环境空气质量应符合GB3095-1996《环境空气质量标准》所规定的二级标准。\r\n\r\n　　（2）品种选择：选用通过审定的，抗逆性强的，中晚熟和中熟偏晚的优质品种。目前全县大面积推广优质水稻品种有农大七号、吉粳88号、吉粳83号、五优一号等。这些品种整精米率高、恶白率低、胶稠度高、米质口感好，符合GB4404.1-1996《农作物种子质量标准》。\r\n\r\n　　（3）生产过程管理，包括农业投入品方面的特殊使用规定：水稻生产以有机肥为主，化肥为辅，化肥必须与有机肥配合使用，有机肥料与无机氮的比例不超过1∶1，禁止施用硝态氮肥。生产过程必须严格按照永吉县《绿色食品水稻种植技术规程》、《绿色食品大米生产操作规程》操作。生产过程中农药和化肥的使用必须符合《绿色食品农药使用准则》（NT/T393-2000）和《绿色食品肥料使用准则》（NY/T394-2000）。\r\n\r\n　　（4）产品收获及产后处理：当籽粒的90%以上变黄成熟,穗轴有三分之二\r\n\r\n　　黄熟，基部有很少一部分绿色籽粒存在时进行收获，收获时要在睛天上午9时以后割地，采用人工或机械收割，割后应捆成小捆进行自然晾晒，并经常翻动，当水分下降到15%时，再进行脱粒。要求不同品种单独收割、单独脱粒、单独贮藏，严禁品种间混杂。要在睛天打场脱粒，以利于降低水份、保证纯度、提高商品质量。\r\n\r\n　　（5）生产记录要求：万昌生产的全过程要建立生产记录，对生产情况、病虫害发生情况、技术措施、农药化肥的使用情况进行全面记载并妥善保存，以备查阅。\r\n\r\n　　产品典型品质特性特征和产品质量安全规定\r\n\r\n　　（1）外在感官特征：万昌大米具有米粒整齐匀称、色泽洁白鲜亮、晶莹剔透、硬度大，外形呈短圆或椭圆形；蒸煮时饭香四溢，饭粒结构紧密，洁白、油亮，入口后滑爽、有粘性、不粘牙，且软硬适中，口味甜、香浓郁，口感细腻，可反复蒸煮米粒不破碎，冷饭不回生。\r\n\r\n　　（2）内在品质指标：万昌大米生产中保留了大米中绝大部分营养物质，避免了米中蛋白质、维生素的大量流失，整精米率≥68%，胶稠度≥79mm，恶白率≤15%，直链淀粉含量≤15%，粗蛋白含量≥6.96%，赖氨酸含量≥0.28%，透明度为1，并富含维生素B1、B2、B6以及钙、铁、硒等物质和微量元素。\r\n\r\n　　（3）安全要求：\r\n\r\n　　①磷化物、氰化物、氮化苦、二硫化碳按GB／T5009．36有关规定执行。\r\n\r\n　　②黄曲霉毒素B1按GB／T5009．22有关规定执行。\r\n\r\n　　③汞按GB／T5009-1996规定执行。\r\n\r\n　　④砷按GB／T5009.11规定执行。\r\n\r\n　　⑤粮食粗蛋白质测按GB/T5511—1985规定执法。\r\n\r\n　　⑥谷物灰分测定按GB48001-84规定执行。\r\n\r\n　　⑦粮食米类加工精度检验按GB5502—85规定执行。\r\n\r\n　　⑧直链淀粉测定按GB8648-87规定执行。\r\n\r\n　　⑨卫生标准按GB2715-81;GB2761-81执行。\r\n\r\n　　5、包装标识等相关规定\r\n\r\n　　（1）分级：产品分A级绿色食品大米、AA级绿色食品大米、有机大米、特等米四个等级。\r\n\r\n　　（2）包装：包装材料应符合国家食品包装卫生要求，还应符合环境保护的要求。大米的销售包装应符合GB/T17109的有关规定，所有包装材料均应清洁、卫生、干燥、无毒、无异味，符合食品卫生要求。所有包装应牢固，不泄漏物料。\r\n\r\n　　（3）标识：标志使用人应在其产品或其包装上统一使用农产品地理标志（万昌大米名称和公共标识图案组合标注型式）。\r\n\r\n　　（4）运输：成品运输工具、车辆必须清洁、卫生、干燥，无其他污染物。成品运输过程中，必须遮盖，防雨防晒，严禁与有毒有害和有异味的物品混运。\r\n\r\n　　（5）储存：成品不得露天堆放。成品仓库必须清洁、干燥、通风，无鼠虫害。成品堆放必须有垫板，离地10cm以上，离墙20cm以上。成品不得与有毒有害、1变质、有不良气味或潮湿的物品同仓库存放。运输、贮藏过程符合NY/T5190-2002的规定。\r\n\r\n　　','2020-05-13 12:26:38',NULL),(9,'公主岭玉米','1ad86d62b55c469e8f1bcf8929952727.jpg',1,3,NULL,'　公主岭被中国粮食行业协会命名为“中国玉米之乡”。公主岭市玉米的淀粉含量保持在71%以上，蛋白质含量保持在9%以上，脂肪含量保持在4%以上。公主岭玉米获国家地理标志证明商标。\r\n　　公主岭市位于吉林省中西部，松辽平原腹地，东辽河中游右岸。该市处于东经124°10′~125°18′，北纬43°11′~44°9′，与在同纬度的美国玉米带、乌克兰玉米带并称为世界“三大黄金玉米带”。公主岭市的玉米无论在产量和成分含量上，都明显好于其他地区。经检测，公主岭市玉米的淀粉含量保持在71%以上，蛋白质含量保持在9%以上，脂肪含量保持在4%以上。\r\n\r\n　　基于公主岭得天独厚的资源优势以及在保障国家粮食安全方面的重要地位，2011年4月25日，中国粮食行业协会将“中国玉米之乡”这一殊荣授予了公主岭。\r\n\r\n　　公主岭玉米\r\n\r\n　　 公主岭市粮食行业协会\r\n\r\n　　 10764020\r\n\r\n　　 玉米','2020-05-13 13:09:29',NULL);

/*Table structure for table `type` */

DROP TABLE IF EXISTS `type`;

CREATE TABLE `type` (
  `type_id` int(31) NOT NULL auto_increment,
  `type_name` varchar(225) default NULL,
  PRIMARY KEY  (`type_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `type` */

insert  into `type`(`type_id`,`type_name`) values (1,'粮食、食材'),(2,'珍贵药材'),(3,'特色美食'),(4,'珍贵皮草');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `user_id` int(11) NOT NULL auto_increment COMMENT '用户id',
  `user_name` varchar(255) NOT NULL COMMENT '用户名称',
  `user_account` varchar(255) NOT NULL COMMENT '用户账号',
  `user_password` varchar(255) default NULL COMMENT '用户密码',
  `user_sex` int(32) default NULL COMMENT '用户性别',
  `user_age` int(32) default NULL COMMENT '用户年龄',
  `user_image` varchar(255) default '1.jpg' COMMENT '用户头像',
  `user_address` varchar(255) default NULL COMMENT '用户地址',
  `role_id` int(255) default NULL COMMENT '用户类别',
  `user_des` varchar(255) default NULL COMMENT '用户个人签名',
  `createDate` datetime default NULL COMMENT '用户创建时间',
  `updateDate` datetime default NULL,
  `user_tel` varchar(255) default NULL COMMENT '用户联系方式',
  `user_status` int(25) default '0',
  PRIMARY KEY  (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`user_id`,`user_name`,`user_account`,`user_password`,`user_sex`,`user_age`,`user_image`,`user_address`,`role_id`,`user_des`,`createDate`,`updateDate`,`user_tel`,`user_status`) values (1,'素心11','123456','123456',1,23,'1.jpg',NULL,1,'','2020-04-23 11:42:14','2020-05-17 00:00:00','13943102015',0),(2,'素心1','123','abc123',0,23,'1.jpg',NULL,2,'喜欢养生追求食物的原始味道','2020-04-26 11:42:28','2020-04-26 18:12:23','13166822008',0),(8,'qq','1234321','1234567',1,35,'1.jpg',NULL,2,'人参爱好者','2020-04-24 00:00:00',NULL,'17843102015',1),(9,'两颗西柚','1234','1234',1,24,'1.jpg',NULL,2,'就是喜欢吃吃吃','2020-04-24 00:00:00',NULL,'13355689257',0),(12,'pangqq','pqq456','12345',1,40,'1.jpg',NULL,3,'开心每一天','2020-04-24 00:00:00',NULL,'15543068566',0),(13,'qianqianqian','pqq1234','123456',1,21,'1.jpg',NULL,3,NULL,'2020-04-24 00:00:00',NULL,'13844038750',0);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
